In [16]:
import pandas as pd

In [18]:
# read file from system
file_path = ("/media/nikhil/Office/GITHUB Project/Salary-analysis-of-India-with-Pandas/Pandas on India Salary/india_salary_summary.csv")

sal = pd.read_csv(file_path)

In [19]:
sal.head()

   Salary/Month        Education               Title Gender    Company Name
0     567595.43  Doctoral degree  Research Scientist   Male  Reliance Inds.
1     538909.28  Master's degree        Data Analyst   Male             TCS
2     335279.91  Master's degree        Data Analyst   Male       HDFC Bank
3     332343.61  Master's degree       Data Engineer   Male             ITC
4     326373.19  Master's degree   Software Engineer   Male         H D F C

In [20]:
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300 entries, 0 to 299
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Salary/Month  300 non-null    float64
 1   Education     300 non-null    object
 2   Title         300 non-null    object
 3   Gender        300 non-null    object
 4   Company Name  293 non-null    object
dtypes: float64(1), object(4)
memory usage: 11.8+ KB

In [22]:
sal['Salary/Month'].mean()

225973.3054

In [25]:
statistical_description = sal['Salary/Month'].describe()
statistical_description

count       300.000000
mean     225973.305400
std       43138.778003
min      196886.550000
25%      202983.897500
50%      213697.540000
75%      232866.255000
max      567595.430000
Name: Salary/Month, dtype: float64

##finding Highest Pay person of all company in this data set.

In [26]:
# max salary of employee in this Dataset
sal[sal['Salary/Month'] == sal['Salary/Month'].max()]

     Salary/Month        Education               Title Gender    Company Name
0       567595.43  Doctoral degree  Research Scientist   Male  Reliance Inds.
299     567595.43  Master's degree      Data Scientist   Male  GIIT Solutions

In [33]:
# finding second highest Salary
highest_salary=sal['Salary/Month'].max()
highest_salary
sal[sal['Salary/Month'] < highest_salary]

,Salary/Month,Education,Title,Gender,Company Name
1,538909.28,Master's degree,Data Analyst,Male,TCS
2,335279.91,Master's degree,Data Analyst,Male,HDFC Bank
3,332343.61,Master's degree,Data Engineer,Male,ITC
4,326373.19,Master's degree,Software Engineer,Male,H D F C
5,316285.74,Bachelor's degree,Data Scientist,Male,Hind. Unilever
...,...,...,...,...,...
294,197133.46,Master's degree,Research Scientist,Male,Nestle India
295,197132.12,Master's degree,Data Scientist,Male,Godrej Consumer
296,196892.64,Master's degree,Data Scientist,Female,Yes Bank
297,196888.39,Master's degree,Data Scientist,Male,Hero Motocorp
298,196886.55,Master's degree,Data Scientist,Male,GIIT Solutions

In [41]:
# looking for salary according to education
type_education = sal.groupby('Education')
type_education.mean()

                         Salary/Month
Education
Bachelor's degree       221381.864940
Doctoral degree         228712.898056
High School             286347.050000
I prefer not to answer  228839.838571
Master's degree         230069.447481
Professional degree     216737.662368

In [44]:
# looking for salary according to Post
type_post = sal.groupby('Title')
type_post.mean()
type_post.describe()

                        Salary/Month                                          \
                               count           mean           std        min
Title
Business Analyst                23.0  221700.079565  30069.023997  197827.17
DBA/Database Engineer            4.0  216207.165000  17928.553675  199292.97
Data Analyst                    20.0  241592.839500  79294.628252  197810.67
Data Engineer                   10.0  219886.871000  39971.975756  197349.04
Data Scientist                  89.0  228529.550449  45735.746398  196886.55
Other                           37.0  223412.529730  22226.225286  197270.60
Product/Project Manager         37.0  221740.267027  23690.617467  198164.45
Research Scientist              23.0  234275.716957  77352.623221  197133.46
Software Engineer               53.0  220735.611887  24521.461154  198005.73
Statistician                     4.0  225055.810000  45375.029243  197423.01


                                 25%         50%          75%        max
Title
Business Analyst         201567.8150  206704.630  230501.2300  303427.55
DBA/Database Engineer    206801.6400  212124.635  221530.1600  241286.42
Data Analyst             202697.3750  211122.045  244380.4625  538909.28
Data Engineer            205705.9475  206940.395  212804.6775  332343.61
Data Scientist           204242.2000  215180.750  236200.9200  567595.43
Other                    207703.2000  215396.500  234848.1100  286213.86
Product/Project Manager  206769.3900  214955.600  230149.2800  307899.46
Research Scientist       202180.9950  207798.790  231479.0850  567595.43
Software Engineer        203260.3300  214988.680  230377.8300  326373.19
Statistician             199721.5575  205064.305  230398.5575  292671.62